---
type: DataStorage
namespace: Autodesk.Revit.DB.ExtensibleStorage
version: 2024
members: 2
tags: [revit-api, class]
---

# DataStorage

`Autodesk.Revit.DB.ExtensibleStorage.DataStorage` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2013 | `public static DataStorage Create ( Document doc )` |
| Property | Parameter | — | `` |